# encoding='utf8'
# file->settings->Editor->file and Code Templates 
# -> Python Script 输入自己的模板
# 查询输入 type check 可对应修改错误等级 例：error warning
# 当前时间 2022/11/26 16:12
''
'''sql简介
    目录
        SQL 是什么
        通用语法
        分类
    
    SQL 是什么
        结构化查询语言（Structured Query Language）简称 SQL
        一种特殊目的的编程语言
        一种数据库查询和程序设计语言
        用于存取数据以及查询、更新和管理关系数据库系统
    
    通用语法
        可以单行或者多行书写，以分号结尾 ;
        可以使用空格和缩进来增加语句的可读性
        不区分大小写，一般关键字大写，数据库名 表名列名小写
        注释方式
        # 单行注释，MySQL 特有的单行注释
        -- 单行注释 
        /*
        多行注释
        */
    
    分类
        数据定义语言（DDL）：用来定义数据库对象，比如数据库，表，列等
        数据操作语言（DML）：用来对数据库中表的记录进行更新
        数据查询语言（DQL）：用来查询数据库中表的记录
        数据控制语言（DCL）：用来定义数据库的访问权限和安全级别及创建用户
    
    '''