# encoding='utf8'
# file->settings->Editor->file and Code Templates 
# -> Python Script 输入自己的模板
# 当前时间 2022/10/17 11:06
''
'''python的运算符
    python基础语法的内容
    通常表示不同数据活变量之间的关系'''
''' +-*/  加减乘除
    %       取余
    **      幂
    //      取整数'''
'''比较运算符
    ==    等于
    ！=    不等于
    > <    大于 小于
    >= <=   大于等于 小于等于'''
#结论：bool  True or False
'''赋值运算符   右边赋值给左边
    =   赋值
    +=  加法赋值
    -=  减法赋值
    *=  乘法赋值
    /=  除法赋值
    %=  取余赋值
    **= 幂赋值
    //= 取证赋值'''

'''逻辑运算符
    and      x and y x，y均为真，真
    or        x  or  y x，y一个为真，真
    not       x为真，not x为假'''

'''成员运算符
    in       指定的序列中找到值返回True，否则返回False
    not in   指定的序列中没有找到值返回True，否则返回False'''

'''身份运算符
    is   判断2个标识符是不是引用一个对象   
    is   ==  区别：值均相等，内存地址不同 
    id(a)  查看内存地址
    not is  判断2个标识符是不是引用不同对象
    '''
#可变的数据结果，即使看着一样，内存地址是不同的，
# 不可变数据类型，如果看着一样，内存地址也是相同的

